#include "m.h"

const BYTE firstpg[8][35] = {
	"╔------------------------------╗",
	"║　　　　  鹏哥贪吃蛇　　　    ║",
	"╠------------------------------╣",
	"║     ↑↓←→控制小蛇移动　   ║",
	"║ 空格键暂停游戏，Q键切换歌曲　║",
	"║        回车键进入游戏　      ║",
	"║       每过10分速度变快　     ║",
	"╚------------------------------╝",
};

const BYTE form[20][35] = {
	"╔------------------------------╗",
	"║　　　　  鹏哥贪吃蛇　　　    ║",
	"╠------------------------------╣",
	"║ 游戏状态：             　　  ║",//3
	"║ 当前分数：　　　   　　 　   ║",//4
	"║ 最高分数： 　　 　　 　　    ║",//5
	"║ 难度进度：           　　　  ║",//6
	"╚------------------------------╝",
	"╔------------------------------╗",
	"║　　　　  快速调节难度　      ║",
	"╠------------------------------╣",
	"║   按数字键1~8能够快速调节    ║",
	"║　　　　　游戏难度　　　      ║",
	"╚------------------------------╝",
	"╔------------------------------╗",
	"║　　　　   操作说明　　　     ║",
	"╠------------------------------╣",
	"║     ↑↓←→控制小蛇移动　   ║",
	"║       空格键暂停游戏       　║",
	"╚------------------------------╝",
};

//图形
#define KONG 0
#define BIAN 1
#define SHE 2
#define GUO 3
//方向
#define SHANG 72
#define XIA 80
#define ZUO 75
#define YOU 77
//颜色
#define BLACK 0
#define WHITE 7

#define RED 12
#define YELLOW 14
#define GREEN 10
#define BLUE 9
#define PURPLE 13

#define YELL 6
#define BLU 1
